<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2
from bs4 import BeautifulSoup # Импортируем библиотеку BeautifulSoup

In [2]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
query_3_1 = "select count(*)\
    from vacancies"

In [5]:
# результат запроса
df_3_1 = pd.read_sql_query(query_3_1, connection)
Vyvod_3_1=f"{df_3_1.iloc[0,0]} вакансий"

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
query_3_2 = "select count(*)\
    from employers"

In [7]:
# результат запроса
df_3_2 = pd.read_sql_query(query_3_2, connection)
Vyvod_3_2=f"{df_3_2.iloc[0,0]} работодателей"

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
# текст запроса
query_3_3 = "select count(*)\
    from areas"

In [9]:
# результат запроса
df_3_3 = pd.read_sql_query(query_3_3, connection)
Vyvod_3_3=f"{df_3_3.iloc[0,0]} регионов(а)"

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
# текст запроса
query_3_4 = "select count(*)\
    from industries"

In [11]:
# результат запроса
df_3_4 = pd.read_sql_query(query_3_4, connection)
Vyvod_3_4=f"{df_3_4.iloc[0,0]} сфер(ы) деятельности"

***

In [12]:
# выводы по предварительному анализу данных
display(f"База данных содержит {Vyvod_3_1}")
display(f"База данных содержит {Vyvod_3_2}")
display(f"База данных содержит {Vyvod_3_3}")
display(f"База данных содержит {Vyvod_3_4}")

'База данных содержит 49197 вакансий'

'База данных содержит 23501 работодателей'

'База данных содержит 1362 регионов(а)'

'База данных содержит 294 сфер(ы) деятельности'

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
# текст запроса
query_4_1 = "select a.name area, count(v.id) cnt\
    from vacancies v \
        join areas a on v.area_id = a.id \
            group by area \
                order by cnt desc \
                    limit 5"

In [14]:
# результат запроса
df_4_1 = pd.read_sql_query(query_4_1, connection)
df_4_1

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [15]:
# текст запроса
query_4_2 = "select count(id) \
    from vacancies \
        where salary_from is NOT NULL or salary_to is not NULL"

In [16]:
# результат запроса
df_4_2 = pd.read_sql_query(query_4_2, connection)
df_4_2

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [17]:
query_df_4_3 = "select \
    round(AVG(f.salary_from)) mean_salary_from,\
        sum(f.salary_to)/count(f.salary_to) mean_salary_to\
    from vacancies f \
        full oUter join  vacancies t on f.id = t.id\
            WHERE f.salary_to is not NULL OR f.salary_from is not NULL"

In [18]:
# результат запроса
df_4_3 = pd.read_sql_query(query_df_4_3, connection)
df_4_3

   mean_salary_from  mean_salary_to
0           71065.0          110536

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [19]:
# текст запроса
query_df_4_4 = "select \
    schedule, \
    employment,\
    count(id) \
from vacancies \
    group by schedule, employment \
        order by count desc \
            offset 1"

In [20]:
# результат запроса
df_4_4 = pd.read_sql_query(query_df_4_4, connection)
df_4_4

            schedule           employment  count
0   Удаленная работа     Полная занятость   7802
1      Гибкий график     Полная занятость   1593
2   Удаленная работа  Частичная занятость   1312
3     Сменный график     Полная занятость    940
4        Полный день           Стажировка    569
5     Вахтовый метод     Полная занятость    367
6        Полный день  Частичная занятость    347
7      Гибкий график  Частичная занятость    312
8        Полный день     Проектная работа    141
9   Удаленная работа     Проектная работа    133
10     Гибкий график           Стажировка    116
11    Сменный график  Частичная занятость    101
12  Удаленная работа           Стажировка     64
13     Гибкий график     Проектная работа     18
14    Сменный график           Стажировка     12
15    Вахтовый метод     Проектная работа      2
16    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [21]:
# текст запроса
query_df_4_5 = "select \
    experience \
from vacancies \
    group by experience \
    order by count(id)"

In [22]:
# результат запроса
df_4_5 = pd.read_sql_query(query_df_4_5, connection)
df_4_5

           experience
0         Более 6 лет
1           Нет опыта
2       От 3 до 6 лет
3  От 1 года до 3 лет

***

In [23]:
# выводы по детальному анализу вакансий
display(f"Наибольшее количество вакансий в регионе {df_4_1.iloc[0,0]}")
display(f"У {df_4_2.iloc[0,0]} вакансий заполнено хотя бы одно из двух полей с зарплатой")
display(f"Средние значения для нижней и верхней границы зарплатной вилки от {df_4_3.iloc[0,0]} до {df_4_3.iloc[0,1]}")
display(f"Наиболее распространённое сочетание типа рабочего графика и типа трудоустройства: {df_4_4.iloc[0,0]} - {df_4_4.iloc[0,1]}")
display(f"Наибольшее количество вакансий с требуемым опытом работы: {df_4_5.iloc[-1,0]}")

'Наибольшее количество вакансий в регионе Москва'

'У 24073 вакансий заполнено хотя бы одно из двух полей с зарплатой'

'Средние значения для нижней и верхней границы зарплатной вилки от 71065.0 до 110536'

'Наиболее распространённое сочетание типа рабочего графика и типа трудоустройства: Удаленная работа - Полная занятость'

'Наибольшее количество вакансий с требуемым опытом работы: От 1 года до 3 лет'

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [24]:
# текст запроса
query_df_5_1 = "select \
    e.name employer, \
    count(v.id) count_vacancies \
from vacancies v \
    join EMPLOYERS e on v.employer_id = e.id\
    group by employer \
    order by count_vacancies desc \
        limit 5"

In [242]:
# результат запроса
df_5_1 = pd.read_sql_query(query_df_5_1, connection)
display(df_5_1.iloc[0,0])
display(df_5_1.iloc[4,0])

'Яндекс'

'Газпром нефть'

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [26]:
# текст запроса
query_df_5_2 = "select \
    a.name area, \
    count(v.id) count_vacancies, \
    count(e.id) count_emploers \
from areas a \
    left JOIN vacancies v on a.id = v.area_id \
    left join EMPLOYERS e on a.id = e.area\
    group by a.name\
    having count(v.id) = 0\
    order by count_emploers desc"

In [27]:
# результат запроса
df_5_2 = pd.read_sql_query(query_df_5_2, connection)
df_5_2.iloc[0,0]

'Россия'

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [28]:
# текст запроса
query_df_5_3 = "select \
    e.name name_employer, \
    count(distinct v.area_id) count_area \
from employers e \
    left JOIN vacancies v on e.id = v.employer_id \
    group by e.name\
    order by count_area desc"

In [29]:
# результат запроса
df_5_3 = pd.read_sql_query(query_df_5_3, connection)
df_5_3

                name_employer  count_area
0                      Яндекс         181
1                  Ростелеком         152
2                  Спецремонт         116
3      Поляков Денис Иванович          88
4                   ООО ЕФИН           71
...                       ...         ...
23170                  СДЕЛКА           0
23171            Alandr Group           0
23172                     СДК           0
23173      Lemon Land Lombard           0
23174                  Махина           0

[23175 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [30]:
# текст запроса
query_df_5_4 = "select \
    count(distinct e.id) count_EMPLOYERS \
from employers e \
    left JOIN EMPLOYERS_INDUSTRIES ei on e.id = ei.employer_id \
    where industry_id is NULL"

In [31]:
# результат запроса
df_5_4 = pd.read_sql_query(query_df_5_4, connection)
df_5_4

   count_employers
0             8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [32]:
# текст запроса
query_df_5_5 = "select \
    e.name name_company \
from employers e \
    left JOIN EMPLOYERS_INDUSTRIES ei on e.id = ei.employer_id \
    group by e.name\
    having count(ei.industry_id) = 4\
    order by  e.name\
        offset 2\
       limit 1"

In [33]:
# результат запроса
df_5_5 = pd.read_sql_query(query_df_5_5, connection)
df_5_5

  name_company
0         2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [34]:
# текст запроса
query_df_5_6 = "select \
    count(ei.employer_id)\
from INDUSTRIES i \
    left JOIN EMPLOYERS_INDUSTRIES ei on i.id = ei.industry_id\
    where i.name = 'Разработка программного обеспечения'"

In [35]:
# результат запроса
df_5_6 = pd.read_sql_query(query_df_5_6, connection)
df_5_6

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [36]:
# код для получения списка городов-милионников

url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
tables = pd.read_html(url)
city_df = tables[1]
city_list = str(tuple((city_df['Город'])))
print(city_list)

('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж[a]', 'Пермь', 'Волгоград')

In [37]:
# текст запроса
query_df_5_7 = "SELECT\
    a.name, \
    COUNT(v.id) AS cnt \
FROM vacancies AS v \
JOIN employers AS e ON \
    e.id = v.employer_id and\
    e.name = 'Яндекс' \
JOIN areas AS a ON \
    a.id = v.area_id \
    AND \
    a.name IN ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж[a]', 'Пермь', 'Волгоград') \
GROUP BY a.name \
UNION ALL \
SELECT \
    'Total', \
    COUNT(*) \
FROM vacancies AS vv \
JOIN employers AS ee ON \
    ee.id = vv.employer_id \
    AND \
    ee.name = 'Яндекс' \
JOIN areas AS aa ON \
    aa.id = vv.area_id \
    AND \
    aa.name IN ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград') \
order by cnt"

In [38]:
# результат запроса
df_5_7 = pd.read_sql_query(query_df_5_7, connection)
df_5_7

               name  cnt
0              Омск   21
1         Челябинск   22
2        Красноярск   23
3         Волгоград   24
4    Ростов-на-Дону   25
5             Пермь   25
6            Казань   25
7               Уфа   26
8            Самара   26
9         Краснодар   30
10      Новосибирск   35
11  Нижний Новгород   36
12     Екатеринбург   39
13  Санкт-Петербург   42
14           Москва   54
15            Total  485

***

In [243]:
# выводы по анализу работодателей
display(f"{df_5_1.iloc[0,0]} и {df_5_1.iloc[4,0]} находятся на первом и пятом месте соответственно по количеству вакансий")
display(f"{df_5_2.iloc[0,0]} - регион с наибольшим количеством работодателей среди регионов, в которых нет вакансий")
display(f"Сфера деятельности не указана у {df_5_4.iloc[0,0]} работадателей")
display(f"На третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности находится: {df_5_5.iloc[0,0]}")
display(f"У  {df_5_6.iloc[0,0]} работодателей в качестве сферы деятельности указана разработка программного обеспечения")

'Яндекс и Газпром нефть находятся на первом и пятом месте соответственно по количеству вакансий'

'Россия - регион с наибольшим количеством работодателей среди регионов, в которых нет вакансий'

'Сфера деятельности не указана у 8419 работадателей'

'На третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности находится: 2ГИС'

'У  3553 работодателей в качестве сферы деятельности указана разработка программного обеспечения'

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [40]:
# текст запроса
query_6_1 = "select \
    count(*) \
from vacancies v \
    where lower(v.name) like '%data%' or lower(v.name) like '%данн%'"

In [41]:
# результат запроса
df_6_1 = pd.read_sql_query(query_6_1, connection)
df_6_1

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [42]:
# текст запроса
query_6_2 = "select \
    count(v.id) \
from vacancies v \
    where (lower(v.name) like '%data scientist%' \
        or lower(v.name) like '%data science%' \
        or lower(v.name) like '%исследователь данных%' \
        or v.name like '%ML%' \
        or lower(v.name) like '%machine learning%' \
        or lower(v.name) like '%машинн%обучен%') \
            and lower(v.name) not like '%html%' \
        and (lower(v.experience) like '%нет опыта%' \
                or lower(v.employment) like '%стажировка%' \
                or lower(v.name) like '%junior%')"

In [43]:
# результат запроса
df_6_2 = pd.read_sql_query(query_6_2, connection)
df_6_2

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [44]:
# текст запроса
query_6_3 = "select \
    count(v.id) \
from vacancies v \
    where (lower(v.name) like '%data scientist%' \
        or lower(v.name) like '%data science%' \
        or lower(v.name) like '%исследователь данных%' \
        or v.name like '%ML%' \
        or lower(v.name) like '%machine learning%' \
        or lower(v.name) like '%машинн%обучен%') \
            and (lower(v.name) not like '%html%') \
        and (v.key_skills like '%SQL%' \
                or lower(v.key_skills) like '%postgres%')"

In [45]:
# результат запроса
df_6_3 = pd.read_sql_query(query_6_3, connection)
df_6_3

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [46]:
# текст запроса
query_6_4 = "select \
    count(v.id) \
from vacancies v \
    where (lower(v.name) like '%data scientist%' \
        or lower(v.name) like '%data science%' \
        or lower(v.name) like '%исследователь данных%' \
        or v.name like '%ML%' \
        or lower(v.name) like '%machine learning%' \
        or lower(v.name) like '%машинн%обучен%') \
            and (lower(v.name) not like '%html%') \
        and (lower(v.key_skills) like '%python%')"

In [47]:
# результат запроса
df_6_4 = pd.read_sql_query(query_6_4, connection)
df_6_4

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [149]:
# текст запроса
query_6_5 = "select \
    v.key_skills \
from vacancies v \
    where (lower(v.name) like '%data scientist%' \
        or lower(v.name) like '%data science%' \
        or lower(v.name) like '%исследователь данных%' \
        or v.name like '%ML%' \
        or lower(v.name) like '%machine learning%' \
        or lower(v.name) like '%машинн%обучен%') \
            and (lower(v.name) not like '%html%') \
        and v.key_skills is not NULL"

In [160]:

def my_func(df): #функция подсчёта навыков по каждой вакансии
    z= len(str(df).split('\t'))
    return z
df_6_5 = pd.read_sql_query(query_6_5, connection) # результат запроса
df_6_5['mean_len'] = (df_6_5['key_skills'].apply(my_func)) #применяем функцию
mean_len = round(df_6_5['mean_len'].mean(), 2) # округление
mean_len #результат

6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [237]:
# текст запроса
query_6_6 = "select \
    v.experience, \
    round(AVG(coalesce((v.salary_from + v.salary_to)/2, v.salary_from, v.salary_to))) mean_salary \
    from vacancies v \
    where (lower(v.name) like '%data scientist%' \
        or lower(v.name) like '%data science%' \
        or lower(v.name) like '%исследователь данных%' \
        or v.name like '%ML%' \
        or lower(v.name) like '%machine learning%' \
        or lower(v.name) like '%машинн%обучен%') \
            and (lower(v.name) not like '%html%') \
        and (v.salary_from is not NULL or v.salary_to is not NULL) \
    group by v.experience"

In [238]:
# результат запроса
df_6_6 = pd.read_sql_query(query_6_6, connection) # результат запроса
df_6_6

           experience  mean_salary
0           Нет опыта      74643.0
1  От 1 года до 3 лет     139675.0
2       От 3 до 6 лет     243115.0

***

In [240]:
# выводы по предметному анализу
display(f" {df_6_1.iloc[0,0]} вакансий имеют отношение к данным")
display(f"Среди всех вакансий, {df_6_2.iloc[0,0]} вакансия подходящая для начинающего дата-сайентиста")
display(f"У {df_6_3.iloc[0,0]} вакансии для DS, в качестве ключевого навыка указан SQL или postgres")
display(f"у {df_6_4.iloc[0,0]} вакансии, в качестве ключевого навыка указан Python")
display(f" {mean_len} ключевых навыков в среднем указывают в вакансиях для DS")
display(f"На {df_6_6.iloc[2,1]} рублей в месяц может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет")

' 1771 вакансий имеют отношение к данным'

'Среди всех вакансий, 51 вакансия подходящая для начинающего дата-сайентиста'

'У 201 вакансии для DS, в качестве ключевого навыка указан SQL или postgres'

'у 351 вакансии, в качестве ключевого навыка указан Python'

' 6.41 ключевых навыков в среднем указывают в вакансиях для DS'

'На 243115.0 рублей в месяц может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет'

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы:
# 1) На момент формирования базы данных, рынок вакансий имеющих отношение к разработке ПО данных довольно ёмок (более 3500 вакансий), половина из которых относится к анализу данных. При этом лишь 51 вакансия подхдит для начинающего специалиста.
# 2) Наиболее ценные DS-специалисты на рынке труда, имеют опыт работы более 3-х лет и обладают шестью и более ключевыми навыками.
# 3) Низкая востебованность начинающих DS-специалистов может говорить о недостаточном качестве образования в этой области или приемущественно ином подходе работадателей при поиске начинающих дата-сайентистов (без использования базы вакансий).
# Например, через ВУЗы или среди победителей хаккатонов. Для уточнения этих предположения требуется дополнительный анализ.